InformationRegisters/ЗагрузкаКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗагрузкаКандидатовИзИнтернета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьГруппаДоступаФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступностьКомментария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступностьКомментарияКандидата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗагрузкиКандидатовИзИнтернета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаДоступаКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКандидата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отложена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Кандидаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Кандидаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резюме</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЗагрузкаКандидатовИзИнтернетаКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьФормуНастройкиДоступа(ФормаВладелец) Экспорт
	ОткрытьФорму("РегистрСведений.ДоступДляЗагрузкиКандидатовИзИнтернета.Форма.НастройкаДоступа", , ФормаВладелец);
КонецПроцедуры

Процедура ФормаСОповещениямиПриОткрытии(Форма, Отказ) Экспорт
	ПодключитьПроверкуЗагруженныхИзИнтернетаКандидатов(Форма);
КонецПроцедуры

Процедура ФормаСОповещениямиПриЗакрытии(Форма) Экспорт
	ОтключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(Форма);
	ОповеститьДругиеФормыОбОтключении(Форма);
КонецПроцедуры

Процедура ФормаСОповещениямиОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ПроверкаЗагруженныхКандидатовВключена" И Источник <> Форма Тогда
		ОтключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(Форма);
	КонецЕсли;

	Если ИмяСобытия = "ПроверкаЗагруженныхКандидатовОтключена" И Источник <> Форма Тогда
		ПодключитьПроверкуЗагруженныхИзИнтернетаКандидатов(Форма);
	КонецЕсли;

	Если ИмяСобытия = "СообщатьОНеЗагруженныхКандидатах" И Источник <> Форма Тогда
		УстановитьУведомленияОНеЗагруженныхКандидатах(Форма, Параметр);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗагруженныхИзИнтернетаКандидатов(Форма) Экспорт

	НовыеЗагрузки = ЗагрузкаКандидатовИзИнтернетаВызовСервера.НовыеЗагрузкиКандидатовИзИнтернета();
	
	Для Каждого Загрузка Из НовыеЗагрузки.Загружены Цикл
		ШаблонСообщения = ?(Загрузка.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский"), 
			НСтр("ru = '%1 загружена с сайта %2'"), 
			НСтр("ru = '%1 загружен с сайта %2'"));
		ПоказатьОповещениеПользователя(НСтр("ru = 'Новый кандидат'"), 
			Новый ОписаниеОповещения("ПоказатьЗагруженногоКандидата", ЭтотОбъект, 
				Новый Структура("Кандидат", Загрузка.Кандидат)), 
			СтрШаблон(ШаблонСообщения, Загрузка.Кандидат, Загрузка.Сайт), 
			Форма.ЛоготипыСайтов[Загрузка.Сайт], 
			СтатусОповещенияПользователя.Важное, 
			Загрузка.Кандидат);
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Загрузка.Кандидат);
	КонецЦикла;
	
	Если УведомлятьОНеЗагруженныхКандидатах(Форма) И НовыеЗагрузки.НеЗагружены.Количество() > 0 Тогда
		ПоказатьОповещениеПользователя(
			СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';%1 кандидат не загружен;;%1 кандидата не загружены;%1 кандидатов не загружены;'"),
				НовыеЗагрузки.НеЗагружены.Количество()),
			Новый ОписаниеОповещения("НачатьПоказНеЗагруженныхКандидатов", ЭтотОбъект, Новый Структура("Форма", Форма)), 
			СтрШаблон(НСтр("ru = 'Резюме кандидатов из браузера не удалось загрузить'")), 
			БиблиотекаКартинок.Предупреждение32, 
			СтатусОповещенияПользователя.Важное, 
			"НеЗагруженныеКандидаты");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодключитьПроверкуЗагруженныхИзИнтернетаКандидатов(Форма)
	
	Если Не Форма.ПроверятьЗагрузкуКандидатовИзИнтернета Тогда
		Возврат;
	КонецЕсли;
	
	// Любая форма, подключенная к оповещениям, подключает свой обработчик.
	// При этом в каждый момент времени обработчик работает только в одной из открытых форм - в самой последней открытой.
	//
	// Кроме обработчика ожидания в каждой форме есть еще реквизит СообщатьОНеЗагруженныхКандидатах (Булево), 
	// который определяет необходимость оповещать об ошибках загрузки. 
	// Особенность этого уведомления в том, что оно 
	// - отключается, когда форма не загруженных кандидатов открывается,
	// - включается, когда форма не загруженных кандидатов закрывается.
	//
	// Как это работает.
	// При открытии каждой формы с оповещением в ней подключается обработчик, и выдается оповещение всем другим формам.
	// При получении этого оповещения любая другая форма с оповещениями:
	// - отключает свой обработчик ожидания оповещения,
	// - сообщает широковещательно о включенности оповещения о не загруженных кандидатах.
	// Если в этот момент в форме было отключено сообщение о не загруженных кандидатах, например, по причине того, 
	// что форма не загруженных была открыта, то об этом будет сообщено новой форме, и в ней тоже отключится сообщение.
	// При закрытии формы сообщение о не загруженных кандидатах включается и об этом также сообщается широковещательно,
	// благодаря чему, сообщение о не загруженных кандидатах включается в другой форме, в которой сейчас обработчик активен.
	
	ПодключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(Форма);
	ВключитьУведомленияОНеЗагруженныхКандидатах(Форма);
	ОповеститьДругиеФормыОПодключении(Форма);
	
КонецПроцедуры

Процедура ПодключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(Форма)
	Форма.ПодключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(ИнтервалПроверкиЗагруженныхКандидатов());
КонецПроцедуры

Процедура ОтключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(Форма)
	Форма.ОтключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов();
	ОповеститьОбИзмененииУведомленияОНеЗагруженныхКандидатах(Форма);
КонецПроцедуры

Процедура ОповеститьДругиеФормыОПодключении(Форма)
	Оповестить("ПроверкаЗагруженныхКандидатовВключена", Неопределено, Форма);
КонецПроцедуры

Процедура ОповеститьДругиеФормыОбОтключении(Форма)
	Оповестить("ПроверкаЗагруженныхКандидатовОтключена", Неопределено, Форма);
КонецПроцедуры

Процедура УстановитьУведомленияОНеЗагруженныхКандидатах(Форма, Состояние)
	
	Если Состояние = УведомлятьОНеЗагруженныхКандидатах(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние Тогда
		ВключитьУведомленияОНеЗагруженныхКандидатах(Форма);
	Иначе
		ОтключитьУведомленияОНеЗагруженныхКандидатах(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВключитьУведомленияОНеЗагруженныхКандидатах(Форма)
	Форма.СообщатьОНеЗагруженныхКандидатах = Истина;
КонецПроцедуры

Процедура ОтключитьУведомленияОНеЗагруженныхКандидатах(Форма)
	Форма.СообщатьОНеЗагруженныхКандидатах = Ложь;
КонецПроцедуры

Процедура ОповеститьОбИзмененииУведомленияОНеЗагруженныхКандидатах(Форма)
	Оповестить("СообщатьОНеЗагруженныхКандидатах", УведомлятьОНеЗагруженныхКандидатах(Форма), Форма);
КонецПроцедуры

Функция УведомлятьОНеЗагруженныхКандидатах(Форма)
	Возврат Форма.СообщатьОНеЗагруженныхКандидатах;
КонецФункции

Функция ИнтервалПроверкиЗагруженныхКандидатов()
	Возврат 10;
КонецФункции

Процедура ПоказатьЗагруженногоКандидата(ДополнительныеПараметры) Экспорт
	ОткрытьФорму("Справочник.Кандидаты.ФормаОбъекта", Новый Структура("Ключ", ДополнительныеПараметры.Кандидат));
КонецПроцедуры

Процедура НачатьПоказНеЗагруженныхКандидатов(ДополнительныеПараметры) Экспорт
	ОтключитьУведомленияОНеЗагруженныхКандидатах(ДополнительныеПараметры.Форма);
	ОткрытьФорму("РегистрСведений.ЗагрузкаКандидатовИзИнтернета.Форма.НеЗагруженныеКандидаты", , 
		ЭтотОбъект, Истина, , , 
		Новый ОписаниеОповещения("ЗавершитьПоказНеЗагруженныхКандидатов", ЭтотОбъект, ДополнительныеПараметры));
КонецПроцедуры

Процедура ЗавершитьПоказНеЗагруженныхКандидатов(Результат, ДополнительныеПараметры) Экспорт
	ВключитьУведомленияОНеЗагруженныхКандидатах(ДополнительныеПараметры.Форма);
	ОповеститьОбИзмененииУведомленияОНеЗагруженныхКандидатах(ДополнительныеПараметры.Форма);
КонецПроцедуры

#КонецОбласти
